//;******************************************************************************
//;* Copyright (c) 1983-2017, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
// *++
//
// Module Name:
//
//   SecureBootMgrStrings.vfr
//
// Abstract:
//
//   String definitions for Secure Boot Manager Utility.
//
// Revision History:
//
// --*/

/=#

#include "Standard.uni"


#string STR_ADMINISTER_SECURE_BOOT_TITLE      #language en-US  "Administer Secure Boot"
                                              #language fr-FR  "Administer Secure Boot"
#string STR_SYSTEM_STATUS_BANNER              #language en-US  "System Status:"
                                              #language fr-FR  "System Status:"
#string STR_SB_NULL_STRING                    #language en-US  " "
                                              #language fr-FR  " "
#string STR_SECURE_BOOT_DATABASE              #language en-US  "Secure Boot Database"
                                              #language fr-FR  "Secure Boot Database"
#string STR_SECURE_BOOT_MODE                  #language en-US  "Secure Boot Mode"
                                              #language fr-FR  "Secure Boot Mode"
#string STR_SETUP_MODE                        #language en-US  "Setup Mode"
                                              #language fr-FR  "Setup Mode"
#string STR_USER_MODE                         #language en-US  "User Mode"
                                              #language fr-FR  "User Mode"
#string STR_AUDIT_MODE                        #language en-US  "Audit Mode"
                                              #language fr-FR  "Audit Mode"
#string STR_DEPLOYED_MODE                     #language en-US  "Deployed Mode"
                                              #language fr-FR  "Deployed Mode"
#string STR_UNLOCKED                          #language en-US  "Unlocked"
                                              #language fr-FR  "Unlocked"
#string STR_INSTALLED_AND_LOCKED              #language en-US  "Installed and Locked"
                                              #language fr-FR  "Installed and Locked"
#string STR_SECURE_BOOT_STATUS                #language en-US  "Secure Boot Status"
                                              #language fr-FR  "Secure Boot Status"
#string STR_CUSTOM_SECURITY                   #language en-US  "User Customized Security"
                                              #language fr-FR  "User Customized Security"
#string STR_YES                               #language en-US  "YES"
                                              #language fr-FR  "YES"
#string STR_NO                                #language en-US  "NO"
                                              #language fr-FR  "NO"
#string STR_SB_OPTIONS_STRING                 #language en-US  "Options:"
                                              #language fr-FR  "Options:"
#string STR_ENROLL_HASH_STRING                #language en-US  "Select a UEFI file as trusted for execution"
                                              #language fr-FR  "Select a UEFI file as trusted for execution"
#string STR_ENROLL_HASH_HELP                  #language en-US  "Add sepecific EFI image hash to allowed database."
                                              #language fr-FR  "Add sepecific EFI image hash to allowed database."
#string STR_SECURE_BOOT_STRING                #language en-US  "Enforce Secure Boot"
                                              #language fr-FR  "Enforce Secure Boot"
#string STR_SECURE_BOOT_HELP                  #language en-US  "Select Disable to Suspend enforcement of Secure Boot Checks."
                                              #language fr-FR  "Select Disable to Suspend enforcement of Secure Boot Checks."
#string STR_CLEAR_SECURE_SETTINGS_STRING      #language en-US  "Erase all Secure Boot Settings"
                                              #language fr-FR  "Erase all Secure Boot Settings"
#string STR_CLEAR_SECURE_SETTINGS_HELP        #language en-US  "Enable this option will erase all Secure Boot Settings. This action will clear four variables PK, KEK, db, and dbx."
                                              #language fr-FR  "Enable this option will erase all Secure Boot Settings. This action will clear four variables PK, KEK, db, and dbx."
#string STR_FACTORY_SETTINGS_STRING           #language en-US  "Restore Secure Boot to Factory Settings"
                                              #language fr-FR  "Restore Secure Boot to Factory Settings"
#string STR_FACTORY_SETTINGS_HELP             #language en-US  "Restore all of the Secure Boot Settings to default factory settings and enable Secure Boot."
                                              #language fr-FR  "Restore all of the Secure Boot Settings to default factory settings and enable Secure Boot."
#string STR_BACKUP_SETTINGS_STRING            #language en-US  "Restore Secure Boot to Backup Settings"
                                              #language fr-FR  "Restore Secure Boot to Backup Settings"
#string STR_BACKUP_SETTINGS_HELP              #language en-US  "Restore all of the secure boot Settings to backup factory settings and enable Secure Boot."
                                              #language fr-FR  "Restore all of the secure boot Settings to backup factory settings and enable Secure Boot."
#string STR_SB_DISABLED_TEXT                  #language en-US  "Disabled"
                                              #language fr-FR  "Désactiver"
#string STR_SB_ENABLED_TEXT                   #language en-US  "Enabled"
                                              #language fr-FR  "Activer"
#string STR_OPERATION_FINISH_MESSAGE          #language en-US  "Operation is completed. System will reset!!"
                                              #language fr-FR  "Operation is completed. System will reset!!"
#string STR_FORMATE_INCORRECT_MESSAGE         #language en-US  "This isn't a vaild EFI image. Please select another file!!"
                                              #language fr-FR  "This isn't a vaild EFI image. Please select another file!!"
#string STR_ADD_HASH_MESSAGE                  #language en-US  "Add this hash image to allowed database (db)"
                                              #language fr-FR  "Add this hash image to allowed database (db)"
#string STR_EXIT_MENU_STRING                  #language en-US  "Exit Discarding Change"
                                              #language fr-FR  "Exit Discarding Change"
#string STR_SAVE_CHANGE_STRING                #language en-US  "Exit saving changes"
                                              #language fr-FR  "Exit saving changes"
#string STR_FILE_NOT_FOUND_MESSAGE            #language en-US  "Cannot find file!!"
                                              #language fr-FR  "Cannot find file!!"
#string STR_FILE_SIZE_TOO_LARGE_MESSAGE       #language en-US  "File size is too large!!"
                                              #language fr-FR  "File size is too large!!"
#string STR_FILE_FORMAT_INCORRECT_MESSAGE     #language en-US  "File format is incorrect!!"
                                              #language fr-FR  "File format is incorrect!!"
#string STR_CLEAR_DEPLOYED_MODE_STRING        #language en-US  "Clear Deployed Mode"
                                              #language fr-FR  "Clear Deployed Mode"
#string STR_CLEAR_DEPLOYED_MODE_HELP          #language en-US  "Clear Deployed Mode value to 0. This operation will cause secure boot mode change from Deployed Mode to User Mode."
                                              #language fr-FR  "Clear Deployed Mode value to 0. This operation will cause secure boot mode change from Deployed Mode to User Mode."
#string STR_SELECT_SECURE_MODE_STRING         #language en-US  "Select Secure Mode"
                                              #language fr-FR  "Select Secure Mode"
#string STR_SELECT_SECURE_MODE_HELP           #language en-US  "Select different secure boot mode. User can select one of 4 different modes (Setup Mode, User Mode, Audit mode and Deployed mode)."
                                              #language fr-FR  "Select different secure boot mode. User can select one of 4 different modes (Setup Mode, User Mode, Audit mode and Deployed mode)."

#string STR_SECURE_BOOT_VAR_PK_OPTION         #language en-US "PK Options"
#string STR_SECURE_BOOT_VAR_PK_OPTION_HELP    #language en-US "Enroll/Delete PK"
#string STR_SECURE_BOOT_VAR_PK_BANNER         #language en-US "PK Signature List:"
#string STR_SECURE_BOOT_VAR_ENROLL_PK         #language en-US "Enroll PK"
#string STR_SECURE_BOOT_VAR_ENROLL_PK_HELP    #language en-US "Enroll PK Using File"
#string STR_SECURE_BOOT_VAR_DELETE_PK         #language en-US "Delete PK"
#string STR_SECURE_BOOT_VAR_DELETE_PK_HELP    #language en-US "Enter into Delete PK Form"

#string STR_SECURE_BOOT_VAR_KEK_OPTION        #language en-US "KEK Options"
#string STR_SECURE_BOOT_VAR_KEK_OPTION_HELP   #language en-US "Enroll/Delete KEK"
#string STR_SECURE_BOOT_VAR_KEK_BANNER        #language en-US "KEK Signature List:"
#string STR_SECURE_BOOT_VAR_ENROLL_KEK        #language en-US "Enroll KEK"
#string STR_SECURE_BOOT_VAR_ENROLL_KEK_HELP   #language en-US "Enroll KEK Using File"
#string STR_SECURE_BOOT_VAR_DELETE_KEK        #language en-US "Delete KEK"
#string STR_SECURE_BOOT_VAR_DELETE_KEK_HELP   #language en-US "Enter into Delete KEK Form"

#string STR_SECURE_BOOT_VAR_DB_OPTION         #language en-US "DB Options"
#string STR_SECURE_BOOT_VAR_DB_OPTION_HELP    #language en-US "Enroll/Delete Signature"
#string STR_SECURE_BOOT_VAR_DB_BANNER         #language en-US "DB Signature List:"

#string STR_SECURE_BOOT_VAR_DBX_OPTION        #language en-US "DBX Options"
#string STR_SECURE_BOOT_VAR_DBX_OPTION_HELP   #language en-US "Enroll/Delete DBX"
#string STR_SECURE_BOOT_VAR_DBX_BANNER        #language en-US "DBX Signature List:"

#string STR_SECURE_BOOT_VAR_ENROLL_SIGNATURE  #language en-US "Enroll Signature"
#string STR_SECURE_BOOT_VAR_DELETE_SIGNATURE  #language en-US "Delete Signature"

#string STR_SIGNATURE_TYPE_UNKNOWN            #language en-US "Unknown"
#string STR_SIGNATURE_TYPE_RSA2048_SHA256     #language en-US "RSA2048_SHA256"
#string STR_SIGNATURE_TYPE_PCKS7              #language en-US "PKCS7"
#string STR_SIGNATURE_TYPE_SHA1               #language en-US "SHA1"
#string STR_SIGNATURE_TYPE_SHA256             #language en-US "SHA256"
#string STR_SIGNATURE_TYPE_SHA512             #language en-US "SHA512"
#string STR_SIGNATURE_TYPE_X509_SHA256        #language en-US "X509_SHA256"
#string STR_SIGNATURE_TYPE_X509_SHA384        #language en-US "X509_SHA384_GUID"
#string STR_SIGNATURE_TYPE_X509_SHA512        #language en-US "X509_SHA512_GUID"

#string STR_SB_EMPTY_STRING                   #language en-US ""
#string STR_SELECT_SIGNATURE_FORMAT_MESSAGE   #language en-US "Select Signature Format"
#string STR_DELETE_SIGNATURE_CONFIRM_MESSAGE  #language en-US "Delete this signature"
#string STR_PK_EXIST_ERROR_MESSAGE            #language en-US "[Error] PK already exists."
#string STR_IDENTICAL_SIGNATURE_ERROR_MESSAGE #language en-US "[Error] There is already an identical signature in signature list."
#string STR_INVALID_GUID_STRING_ERROR_MESSAGE #language en-US "[Error] Invalid GUID string. GUID string should be in 12345678-1234-1234-1234-1234567890ab format."
#string STR_ENROLL_SIGNATURE_FILE_HELP        #language en-US "Input Owner_GUID in 12345678-1234-1234-1234-1234567890ab format."
#string STR_READY_TO_BOOT_SIGNALED_STRING     #language en-US "The operation is only allowed before booting any boot device!!! Please reset system and enter this menu directly if need use this operation."